Revit 2026 API

# CeramicCeramicPattern Property

---

The property labeled "Relief Pattern" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicPattern { get; }
```
```vb
Public Shared ReadOnly Property CeramicPattern As String
	Get
```
```cpp
public:
static property String^ CeramicPattern {
	String^ get ();
}
```
```fsharp
static member CeramicPattern : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicPatternType".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace